Revit 2024 API
Rectangle Constructor
 Create an empty Rectangle instance with values (0,0,0,0).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Rectangle()
Visual Basic
Public Sub New
Visual C++
public:
Rectangle()
See Also
Rectangle Class
Rectangle Overload
Autodesk.Revit.DB Namespace